import {FaRegUser} from "react-icons/fa";
import {IoBagOutline} from "react-icons/io5";
import React from "react";

const images = [
    {id:1, name: "/image/purple.png", color: "bg-purple-500" ,text:"عقد وفرمالیته"},
    {id:2, name: "/image/green.png", color: "bg-teal-700" ,text:"عقد وفرمالیته"},
    {id:3, name: "/image/red.png", color: "bg-red-600" ,text:"عقد وفرمالیته"},
    {id:4, name: "/image/black.png", color: "bg-zinc-900" ,text:"عقد وفرمالیته"},
    {id:5, name: "/image/black.png", color: "bg-zinc-900" ,text:"عقد وفرمالیته"},
    {id:6, name: "/image/green.png", color: "bg-teal-700" ,text:"عقد وفرمالیته"},
    {id:7, name: "/image/red.png", color: "bg-red-600" ,text:"عقد وفرمالیته"}
];


const DataBlog = [
    {
        id: 1,
        image: "/image/Rectangle 236.png",
        title: "روش شستشو و نگهداری لباس شب",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "لباس‌های شب از پارچه‌های حساس مانند حریر، ساتن، مخمل، گیپور، تور و ابریشم تهیه می‌شوند، بنابراین شستشوی آن‌ها نیاز به دقت و مراقبت ویژه دارد.",

        },
        time: "۲۰ مهر ۱۴۰۱",
        time_see: "۵ دقیقه زمان خواندن",
        images: ["/image/img1.jpg", "/image/img2.png", "/image/img3.png", "/image/img4.png", "/image/img5.png"]
    },
    {
        id: 2,
        image: "/image/Rectangle 236.png",
        title: "نحوه صحیح نگهداری لباس شب در کمد",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "استفاده از چوب‌لباسی مناسب می‌تواند از تغییر فرم لباس جلوگیری کند.",

        },
        time: "۲۵ مهر ۱۴۰۱",
        time_see: "۴ دقیقه زمان خواندن",
        images: ["/image/img6.jpg", "/image/img7.png", "/image/img8.png", "/image/img9.png", "/image/img10.png"]
    },
    {
        id: 3,
        image: "/image/Rectangle 236.png",
        title: "شستشوی لباس‌های حریر و ساتن",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "از مواد شوینده ملایم و آب سرد استفاده کنید.",

        },
        time: "۳۰ مهر ۱۴۰۱",
        time_see: "۶ دقیقه زمان خواندن",
        images: ["/image/img11.jpg", "/image/img12.png", "/image/img13.png", "/image/img14.png", "/image/img15.png"]
    },
    {
        id: 4,
        image: "/image/Rectangle 236.png",
        title: "اتوکشی لباس‌های ظریف بدون آسیب",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "بخاردهی به لباس بدون تماس مستقیم اتو روش مناسبی است.",

        },
        time: "۵ آبان ۱۴۰۱",
        time_see: "۵ دقیقه زمان خواندن",
        images: ["/image/img16.jpg", "/image/img17.png", "/image/img18.png", "/image/img19.png", "/image/img20.png"]
    },
    {
        id: 5,
        image: "/image/Rectangle 236.png",
        title: "نگهداری لباس‌های شب مزین به سنگ‌دوزی و مروارید",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "باید از برخورد با سایر لباس‌ها و فشار زیاد جلوگیری شود.",
        },
        time: "۱۰ آبان ۱۴۰۱",
        time_see: "۷ دقیقه زمان خواندن",
        images: ["/image/img21.jpg", "/image/img22.png", "/image/img23.png", "/image/img24.png", "/image/img25.png"]
    },
    {
        id: 6,
        image: "/image/Rectangle 236.png",
        title: "نگهداری لباس‌های شب مزین به سنگ‌دوزی و مروارید",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "باید از برخورد با سایر لباس‌ها و فشار زیاد جلوگیری شود.",
        },
        time: "۱۰ آبان ۱۴۰۱",
        time_see: "۷ دقیقه زمان خواندن",
        images: ["/image/img21.jpg", "/image/img22.png", "/image/img23.png", "/image/img24.png", "/image/img25.png"]
    }
];
const DataComment =[
    {id:1 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:2 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:3 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:4 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:6 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:7 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:8 , name:"نیما احمدی" ,image:"/image/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
]

const menuItems = [
    {name: "صفحه اصلی", href: "/"},
    {name: "محصولات ما", href: "/Products"},
    {name: "درباره ما", href: "/About"},
    {name: "تماس با ما", href: "/Contact"},
    {name: "فروشگاه ما", href: "/Products"},
];

const icons = [
    {src: "/image/Group 9.svg", alt: "Notifications", size: 20},
    {src: <FaRegUser/>, alt: "Profile", size: 24},
    {icon: <IoBagOutline/>, alt: "Shopping Bag", size: 24},
];

const availableColors = [
    { name: "قرمز", hex_code: "#FF0000" },
    { name: "سبز", hex_code: "#00FF00" },
    { name: "آبی", hex_code: "#0000FF" },
    { name: "زرد", hex_code: "#FFFF00" },
    { name: "مشکی", hex_code: "#000000" },
    { name: "سفید", hex_code: "#FFFFFF" },
    { name: "نارنجی", hex_code: "#FFA500" },
    { name: "بنفش", hex_code: "#800080" },
    { name: "صورتی", hex_code: "#FFC0CB" },
    { name: "قهوه‌ای", hex_code: "#8B4513" },
    { name: "آبی آسمانی", hex_code: "#87CEEB" },
    { name: "فیروزه‌ای", hex_code: "#40E0D0" },
    { name: "لیمویی", hex_code: "#FFF700" },
    { name: "خاکستری", hex_code: "#808080" },
    { name: "آبی نفتی", hex_code: "#000080" },
    { name: "سبز زیتونی", hex_code: "#808000" },
    { name: "زرد طلایی", hex_code: "#FFD700" },
    { name: "آبی فیروزه‌ای", hex_code: "#00CED1" },
    { name: "ارغوانی", hex_code: "#C71585" },
    { name: "لاجوردی", hex_code: "#1E90FF" },
    { name: "زرشکی", hex_code: "#800000" },
    { name: "یشمی", hex_code: "#00A86B" },
    { name: "آبی کاربنی", hex_code: "#003366" },
    { name: "نیلی", hex_code: "#4B0082" },
    { name: "سبز چمنی", hex_code: "#7CFC00" },
    { name: "زیتونی روشن", hex_code: "#9ACD32" },
    { name: "کرم", hex_code: "#FFFDD0" },
    { name: "خاکی", hex_code: "#F0E68C" },
    { name: "برنزی", hex_code: "#CD7F32" },
    { name: "نقره‌ای", hex_code: "#C0C0C0" },
    { name: "طلایی", hex_code: "#FFD700" },
    { name: "آبی آکوامارین", hex_code: "#7FFFD4" },
    { name: "سبز دریایی", hex_code: "#2E8B57" },
    { name: "قرمز شرابی", hex_code: "#B22222" },
    { name: "خاکستری روشن", hex_code: "#D3D3D3" }
];

export {DataBlog, images , DataComment , menuItems , icons , availableColors}