
const images = [
    {id:1, name: "/purple.png", color: "bg-purple-500" ,text:"عقد وفرمالیته"},
    {id:2, name: "/green.png", color: "bg-teal-700" ,text:"عقد وفرمالیته"},
    {id:3, name: "/red.png", color: "bg-red-600" ,text:"عقد وفرمالیته"},
    {id:4, name: "/black.png", color: "bg-zinc-900" ,text:"عقد وفرمالیته"},
    {id:5, name: "/black.png", color: "bg-zinc-900" ,text:"عقد وفرمالیته"},
    {id:6, name: "/green.png", color: "bg-teal-700" ,text:"عقد وفرمالیته"},
    {id:7, name: "/red.png", color: "bg-red-600" ,text:"عقد وفرمالیته"}
];


const DataBlog = [
    {
        id: 1,
        image: "/Rectangle 236.png",
        title: "روش شستشو و نگهداری لباس شب",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "لباس‌های شب از پارچه‌های حساس مانند حریر، ساتن، مخمل، گیپور، تور و ابریشم تهیه می‌شوند، بنابراین شستشوی آن‌ها نیاز به دقت و مراقبت ویژه دارد.",

        },
        time: "۲۰ مهر ۱۴۰۱",
        time_see: "۵ دقیقه زمان خواندن",
        images: ["/img1.jpg", "/img2.png", "/img3.png", "/img4.png", "/img5.png"]
    },
    {
        id: 2,
        image: "/Rectangle 236.png",
        title: "نحوه صحیح نگهداری لباس شب در کمد",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "استفاده از چوب‌لباسی مناسب می‌تواند از تغییر فرم لباس جلوگیری کند.",

        },
        time: "۲۵ مهر ۱۴۰۱",
        time_see: "۴ دقیقه زمان خواندن",
        images: ["/img6.jpg", "/img7.png", "/img8.png", "/img9.png", "/img10.png"]
    },
    {
        id: 3,
        image: "/Rectangle 236.png",
        title: "شستشوی لباس‌های حریر و ساتن",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "از مواد شوینده ملایم و آب سرد استفاده کنید.",

        },
        time: "۳۰ مهر ۱۴۰۱",
        time_see: "۶ دقیقه زمان خواندن",
        images: ["/img11.jpg", "/img12.png", "/img13.png", "/img14.png", "/img15.png"]
    },
    {
        id: 4,
        image: "/Rectangle 236.png",
        title: "اتوکشی لباس‌های ظریف بدون آسیب",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "بخاردهی به لباس بدون تماس مستقیم اتو روش مناسبی است.",

        },
        time: "۵ آبان ۱۴۰۱",
        time_see: "۵ دقیقه زمان خواندن",
        images: ["/img16.jpg", "/img17.png", "/img18.png", "/img19.png", "/img20.png"]
    },
    {
        id: 5,
        image: "/Rectangle 236.png",
        title: "نگهداری لباس‌های شب مزین به سنگ‌دوزی و مروارید",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "باید از برخورد با سایر لباس‌ها و فشار زیاد جلوگیری شود.",
        },
        time: "۱۰ آبان ۱۴۰۱",
        time_see: "۷ دقیقه زمان خواندن",
        images: ["/img21.jpg", "/img22.png", "/img23.png", "/img24.png", "/img25.png"]
    },
    {
        id: 6,
        image: "/Rectangle 236.png",
        title: "نگهداری لباس‌های شب مزین به سنگ‌دوزی و مروارید",
        descriptions: {
            des1: "در بحث امروز می‌خواهیم به شما کمک کنیم تا در رابطه با اتوکشی لباس‌های شب و روش نگهداری و شستشو را به شما آموزش دهیم.",
            des2: "باید از برخورد با سایر لباس‌ها و فشار زیاد جلوگیری شود.",
        },
        time: "۱۰ آبان ۱۴۰۱",
        time_see: "۷ دقیقه زمان خواندن",
        images: ["/img21.jpg", "/img22.png", "/img23.png", "/img24.png", "/img25.png"]
    }
];
const DataComment =[
    {id:1 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:2 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:3 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:4 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:6 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:7 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
    {id:8 , name:"نیما احمدی" ,image:"/users.png"  ,des:"لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشدلورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد"},
]

export {DataBlog, images , DataComment}